<a href="https://colab.research.google.com/github/plthiyagu/AI-Engineering/blob/master/03-Pandas/Pandas_quick.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
# Create team data
data_england = {'Name': ['Kane', 'Sterling', 'Saka', 'Maguire'], 'Age': [27, 26, 19, 28]}
data_italy = {'Name': ['Immobile', 'Insigne', 'Chiellini', 'Chiesa'], 'Age': [31, 30, 36, 23]}

In [5]:
# Create Dataframe
df_england = pd.DataFrame(data_england)
df_italy = pd.DataFrame(data_italy)

In [6]:
df_italy

        Name  Age
0   Immobile   31
1    Insigne   30
2  Chiellini   36
3     Chiesa   23

In [7]:
df_england

       Name  Age
0      Kane   27
1  Sterling   26
2      Saka   19
3   Maguire   28

In [8]:
frames = [df_england, df_italy]
both_teams = pd.concat(frames)
both_teams

        Name  Age
0       Kane   27
1   Sterling   26
2       Saka   19
3    Maguire   28
0   Immobile   31
1    Insigne   30
2  Chiellini   36
3     Chiesa   23

In [9]:
df_england.append(df_italy)

        Name  Age
0       Kane   27
1   Sterling   26
2       Saka   19
3    Maguire   28
0   Immobile   31
1    Insigne   30
2  Chiellini   36
3     Chiesa   23

In [10]:
pd.concat(frames, keys=["England", "Italy"])

                Name  Age
England 0       Kane   27
        1   Sterling   26
        2       Saka   19
        3    Maguire   28
Italy   0   Immobile   31
        1    Insigne   30
        2  Chiellini   36
        3     Chiesa   23

In [11]:
both_teams[both_teams["Age"] >= 30]

        Name  Age
0   Immobile   31
1    Insigne   30
2  Chiellini   36

In [12]:
both_teams[both_teams["Name"].str.startswith('S')]

       Name  Age
1  Sterling   26
2      Saka   19

In [13]:
club = ['Tottenham', 'Man City', 'Arsenal', 'Man Utd']
# 'Associated Club' is our new column name
df_england['Associated Clubs'] = club
df_england

       Name  Age Associated Clubs
0      Kane   27        Tottenham
1  Sterling   26         Man City
2      Saka   19          Arsenal
3   Maguire   28          Man Utd

In [14]:
frames = [df_england, df_italy]
both_teams = pd.concat(frames)
both_teams

        Name  Age Associated Clubs
0       Kane   27        Tottenham
1   Sterling   26         Man City
2       Saka   19          Arsenal
3    Maguire   28          Man Utd
0   Immobile   31              NaN
1    Insigne   30              NaN
2  Chiellini   36              NaN
3     Chiesa   23              NaN

In [15]:
both_teams['Associated Clubs'].fillna('No Data Found', inplace=True)
both_teams

        Name  Age Associated Clubs
0       Kane   27        Tottenham
1   Sterling   26         Man City
2       Saka   19          Arsenal
3    Maguire   28          Man Utd
0   Immobile   31    No Data Found
1    Insigne   30    No Data Found
2  Chiellini   36    No Data Found
3     Chiesa   23    No Data Found

In [16]:
both_teams.sort_values('Name')

        Name  Age Associated Clubs
2  Chiellini   36    No Data Found
3     Chiesa   23    No Data Found
0   Immobile   31    No Data Found
1    Insigne   30    No Data Found
0       Kane   27        Tottenham
3    Maguire   28          Man Utd
2       Saka   19          Arsenal
1   Sterling   26         Man City

In [17]:
both_teams.sort_values('Age')

        Name  Age Associated Clubs
2       Saka   19          Arsenal
3     Chiesa   23    No Data Found
1   Sterling   26         Man City
0       Kane   27        Tottenham
3    Maguire   28          Man Utd
1    Insigne   30    No Data Found
0   Immobile   31    No Data Found
2  Chiellini   36    No Data Found

In [18]:
both_teams.sort_values('Age', ascending=False)

        Name  Age Associated Clubs
2  Chiellini   36    No Data Found
0   Immobile   31    No Data Found
1    Insigne   30    No Data Found
3    Maguire   28          Man Utd
0       Kane   27        Tottenham
1   Sterling   26         Man City
3     Chiesa   23    No Data Found
2       Saka   19          Arsenal

In [19]:
a = {
    'UserID': ['U1001', 'U1002', 'U1001', 'U1001', 'U1003'],
    'Transaction': [500, 300, 200, 300, 700]
}
df_a = pd.DataFrame(a)
df_a

  UserID  Transaction
0  U1001          500
1  U1002          300
2  U1001          200
3  U1001          300
4  U1003          700

In [20]:
df_a.groupby('UserID').sum()

        Transaction
UserID
U1001          1000
U1002           300
U1003           700

In [21]:
df_a.groupby('UserID').get_group('U1001')

  UserID  Transaction
0  U1001          500
2  U1001          200
3  U1001          300